app/decorators/room_decorator.rb

SELECT `locations`.`name` FROM `locations`
---
  def select_option
    Location.pluck :name