app/controllers/admin/users_controller.rb

SELECT  `users`.* FROM `users` ORDER BY `users`.`name` ASC LIMIT 10 OFFSET 0
SELECT COUNT(*) FROM `users`
---
    def index
      @users = User.order(:name).page(params[:page])
        .per Settings.controllers.admin.users.pag

SELECT COUNT(*) FROM `users` WHERE (((((all LIKE '%Aaaaaa%') OR (name LIKE '%Aaaaaa%')) OR (email LIKE '%Aaaaaa%')) OR (created_at LIKE '%Aaaaaa%')) OR (updated_at LIKE '%Aaaaaa%'))
SELECT `users`.* FROM `users` WHERE (name LIKE '%H%')
---
    def search
      @users = SearchQuery.new(User,search_params,Settings.search_fields.user).all.page(params[:page]).per Settings.controllers.admin.users.pag

UPDATE `users` SET `name` = 'Hoang Anh Tu A', `password_digest` = '$2a$10$J9agUfHeGuvC2XNSeW1VSOly6pfD2oqvfKz0vRbHRYUL6p8YX9omO', `updated_at` = '2019-05-11 15:35:34' WHERE `users`.`id` = 5
---
    def update
      if @user.update user_params

DELETE FROM `users` WHERE `users`.`id` = 3
---
    def destroy
      if @user.destroy

SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
---
    def load_user
      @user = User.find_by id: params[:id]