app/controllers/manager/locations_controller.rb

SELECT  `locations`.* FROM `locations` LIMIT 25 OFFSET 0
---
  def index
    @locations= Location.all.page(params[:page]).per Settings.page

SELECT  `locations`.* FROM `locations` WHERE (national LIKE '%Vung%') LIMIT 25 OFFSET 0
---
  def search
    @locations = SearchQuery.new(Location,search_params,Settings.search_fields.location).all.page(params[:page]).per Settings.page

SELECT  `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1
---
  def load_location
    @location = Location.find_by id: params[:id]