app/controllers/manager/rooms_controller.rb

  def index
    @rooms= Room.list.page(params[:page]).per Settings.page
---
SELECT  `rooms`.* FROM `rooms` LIMIT 5 OFFSET 0

  def search
    @rooms = SearchService.new(Room,search_params,Settings.search_fields.room).all_records
      .page(params[:page]).per Settings.page
---
SELECT  `rooms`.* FROM `rooms` WHERE (national LIKE '%Vung%') LIMIT 25 OFFSET 0

  def create
    @room = Room.new room_params
    if @room.save
---
INSERT INTO `rooms` (`name`, `occupancy_limit`, `living_room`, `bed_room`, `bath_room`, `number_of_bed`, `quantity`, `price`, `bed_detail_id`, `location_id`, `created_at`, `updated_at`, `pictures`) VALUES ('VIP2', 1, 1, 1, 1, 1, 5, 150000.0, 1, 1, '2019-05-14 07:36:02', '2019-05-14 07:36:02', '[\"Screenshot_from_2019-04-26_13-04-14.png\",\"Screenshot_from_2019-04-30_12-20-07.png\",\"Screenshot_from_2019-04-30_13-29-04.png\"]')

  def load_room
    @room = Room.find_by id: params[:id]
---
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1