app/controllers/accounts_controller.rb

INSERT INTO `users` (`name`, `email`, `password_digest`, `activation_digest`, `created_at`, `updated_at`) VALUES ('Hoang Anh Tu', 'anhtu26081996@gmail.com', '$2a$10$NNmU669aX3rvQlFgXznPI.u0CTVSOx1w3gsckiKI6gGKaewoM/6Z6', '$2a$10$741BmHAMkcrHj3VTIJ1dkuPnxn3rsCOeK2bnVRmkin5a0oSNWUj1y', '2019-05-12 17:42:45', '2019-05-12 17:42:45')
---
  def create
    @account = User.new user_params
    if @account.save