app/controllers/locations_controller.rb

  def show
    @location = Location.includes(:reviews, :rooms).find_by id: params[:id]
---
SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`location_id` = 1 ORDER BY id desc
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`location_id` = 1