app/controllers/locations_controller.rb

  def show
    @pictures = @location.pictures
    @reviews = @location.reviews
    @hasReview = @reviews.find_by(user_id: current_user.id) if current_user
---
SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`location_id` = 1 AND `reviews`.`user_id` = 1 LIMIT 1

    def set_location
      @location = Location.find(params[:id])
---
SELECT  `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1