app/controllers/reviews_controller.rb

INSERT INTO `reviews` (`user_id`, `location_id`, `comment`, `rate`, `created_at`, `updated_at`) VALUES (1, 1, 'abc', 4, '2019-05-15 16:05:37', '2019-05-15 16:05:37')
---
  def create
    @review = current_user.reviews.create(review_params)

SELECT  `reviews`.* FROM `reviews` WHERE `reviews`.`id` = 1 LIMIT 1
DELETE FROM `reviews` WHERE `reviews`.`id` = 1
---
  def destroy
    @review = Review.find(params[:id])
    location = @review.location
    @review.destroy