app/controllers/rooms_controller.rb

  def load_location
    @location =Location.find_by id: params[:location_id]
---
SELECT  `locations`.* FROM `locations` WHERE `locations`.`id` = 1 LIMIT 1

  def load_room
    @room = Room.find_by id: params[:id]
---
SELECT  `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1