app/models/review.rb

SELECT AVG(`reviews`.`rate`) FROM `reviews` WHERE `reviews`.`location_id` = 1
UPDATE `locations` SET `total_rate` = 3.5 WHERE `locations`.`id` = 1
---
  def rate_calculate
    average_rate = self.location.reviews.average(:rate)
    self.location.update_columns(total_rate: average_rate)