app/views/reviews/_list.html.erb

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`location_id` = 1 ORDER BY id desc
SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`location_id` = 1
---
<% if @location.reviews.count == 0 %>

SELECT `reviews`.* FROM `reviews` WHERE `reviews`.`location_id` = 1 ORDER BY id desc
---
<% else %>
  <% @location.reviews.order("id desc").each do |r| %>