app/views/locations/_location.html.erb

      <p>
        View on map   |   <%= location.reviews.count %> Reviews
---
SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`location_id` = 1