app/views/locations/show.html.erb

  <div class="col-md-12">
    <h3><%= t ".reviews" %><span><%= @location.total_rate%></span> (<%= @location.reviews.count %>)</h3>
---
SELECT COUNT(*) FROM `reviews` WHERE `reviews`.`location_id` = 1