app/views/locations/show.html.erb

        <tbody>
          <% @location.rooms.each do |l| %>
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`location_id` = 1